[
  {
    "title": "Bushiri unveils K50m tournament in Dowa",
    "link": "https://times.mw/bushiri-unveils-k50m-tournament-in-dowa/?utm_source=rss&utm_medium=rss&utm_campaign=bushiri-unveils-k50m-tournament-in-dowa",
    "published": "Wed, 04 Feb 2026 09:54:23 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"620\" src=\"https://times.mw/wp-content/uploads/2026/02/shephard-bushiri.jpg\" width=\"570\" /><p><strong>By Mphatso M’bang’ombe </strong></p>\n<p>Prophet Shepherd Bushiri has announced that he will introduce a football trophy worth about K50 million in Dowa District for local football teams to be competing for.</p>\n<p>The initiative is expected to be one of the biggest investments in grassroots football in the district and has already generated excitement among players and football administrators.</p>\n<p>Bushiri made the announcement when his organisation, the Shepherd Bushiri Foundation, conducted a two-day football talent identification exercise at Dapp Teachers Training College (TTC) and Dowa Community Ground.</p>\n<p>Speaking at the event, Bushiri said the competition was aimed at giving young people the platform to realise their dreams through sport.</p>\n<p>“Football has the power to transform lives. Through this trophy, we want to give hope to talented youths in Dowa and help them reach greater heights,” he said.</p>\n<p>Prophet Bushiri’s spokesperson, Aubrey Kusakala, said once all arrangements were finalised, they would announce the date and time when the competition would commence.</p>\n<p>“This is a serious and long-term project. We are currently consulting all relevant stakeholders so that the tournament is organised in a professional manner,” Kusakala said.</p>\n<p>Kusakala said that the initiative was aimed at promoting football and responding to concerns that were raised by the Dowa District Football Association (DDFA) committee.</p>\n<p>In his remarks, Solomon Chirwa, who is chairperson for the district sports committee, commended Bushiri for establishing the trophy in the district, saying it would help to develop football in the area.</p>\n<p>“For many years, our teams have struggled due to lack of sponsorship. This support will revive football in Dowa and expose our players to bigger opportunities,” Chirwa said.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "Mangolongondo Night kickstarts 2026 gigs",
    "link": "https://times.mw/mangolongondo-night-kickstarts-2026-gigs/?utm_source=rss&utm_medium=rss&utm_campaign=mangolongondo-night-kickstarts-2026-gigs",
    "published": "Wed, 04 Feb 2026 09:52:40 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"662\" src=\"https://times.mw/wp-content/uploads/2026/02/goma-nyondo-1024x662.jpg\" width=\"1024\" /><p>Mangolongondo Night turned on the lights for the 2026 schedule on Friday as it hosted musicians Goma Nyondo, Samax, Danil and Zisekese Band at Kwaharaba Art Gallery and Café in Blantyre.</p>\n<p>This was the first of the concerts, laying the foundation for Mangolongondo Night, which is held on the last Friday of every month.</p>\n<p>Mangolongondo Night is driven by a number of players and hosted by renowned actor and contemporary dancer Roberto Magasa.</p>\n<p>Music lovers showed up for the concert and enjoyed the performances, dancing and singing along to the tracks—with Goma opening the proceedings before Samax, Danil and Zisekese Band closed the curtain.</p>\n<p>On a serene night, Goma dished out a number of songs, including ‘Sowela’, in a one-act performance that saw him interacting with patrons at will.</p>\n<p>Armed with his guitar, the husky-voiced musician, who is also a member of Mibawa Band, had a moment to dish out the cover song ‘Todii’ of Zimbabwean star Oliver Mtukudzi.</p>\n<p>The musician bowed out when the stage was lively, with Samax, Danil and Zisekese Band breathing in more life.</p>\n<p>Samax led the act as a lead vocalist, with the performance dragging patrons to the dance floor.</p>\n<p>The performance resonated well with patrons, as Samax, Danil and Zisekese Band delivered a number of cover songs from, among others, Lulu, Soldier Lucius Banda and Giddes Chalamanda.</p>\n<p>“It has been a great night. Patrons were active throughout. This is the first show for us this year and we, as organisers, are happy to start our schedule on a high note,” Magasa said.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "Lucky Stars eyes gigs",
    "link": "https://times.mw/lucky-stars-eyes-gigs/?utm_source=rss&utm_medium=rss&utm_campaign=lucky-stars-eyes-gigs",
    "published": "Wed, 04 Feb 2026 09:51:00 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"1024\" src=\"https://times.mw/wp-content/uploads/2026/02/boniface-ndamera-951x1024.jpg\" width=\"951\" /><p>Lucky Stars Band, famed for the hit ‘Chinafuna Mbale’, has said it wants to reach out to all the corners of the country with live performances this year.</p>\n<p>Led by Boniface Ndamera, the band had a few gigs last year.</p>\n<p>Ndamera admitted Tuesday that despite being in the trade of music for years, they have failed to reach out to all corners of the country with live shows because of lack of funds.</p>\n<p>“We have, for the past five years, been lamenting the absence of a manager. We would love to be managed and have a manager who can help drive us forward. The other challenge is funds; if we had enough funds in our coffers, we would have been active with concerts,” he said.</p>\n<p>Ndamera boosted that Lucky Stars Band has more songs, both old and new, and that, much as the current generation is into new trends of music, they are unique and ready to be counted.</p>\n<p>Lucky Stars Band will later this month invade Lilongwe for a birthday gig.</p>\n<p>“We want to say that we, as a band, are open to performances at weddings, birthday parties and other platforms. Let companies utilise us,” Ndamera said.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "President Mutharika, Minister Ben Phiri Among Five Malawians Nominated for Iconic Africa Honours 2026",
    "link": "https://www.malawivoice.com/2026/02/04/president-mutharika-minister-ben-phiri-among-five-malawians-nominated-for-iconic-africa-honours-2026/",
    "published": "Wed, 04 Feb 2026 09:01:32 +0000",
    "summary": "President Professor Arthur Peter Mutharika and Minister of Local Government and Rural Development, Dr. Ben Malunga Phiri, are among five esteemed Malawians nominated for the prestigious Iconic Africa Honours 2026 awards, to be presented on 13 February 2026 at the Rainbow Towers and Conference Centre, Harare in Zimbabwe. The other nominees include, Malawi Communications Regulatory [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "Hospitalized woman robbed: Fugitive jailed after two-year hunt",
    "link": "https://www.faceofmalawi.com/2026/02/04/hospitalized-woman-robbed-fugitive-jailed-after-two-year-hunt/",
    "published": "Wed, 04 Feb 2026 08:22:05 +0000",
    "summary": "The First Grade Magistrate Court in Chiradzulu has slapped 24-year-old Fredson Manyamba with a four-year jail term for breaking into [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "Lessons from 2025 elections",
    "link": "https://mwnation.com/lessons-from-2025-elections/",
    "published": "Wed, 04 Feb 2026 08:11:00 +0000",
    "summary": "<p>The Centre for Multiparty Democracy (CMD) has been holding regional meetings with political parties to facilitate healing and learning from the September 16 2025 General Election. The regional stock-take seeks to identify challenges and pave the way for the possible electoral reforms. In this interview, Our News Analyst LUCKY MKANDAWIRE spoke to CMD executive director &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/lessons-from-2025-elections/\">Lessons from 2025 elections</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "Morocco reportedly to request CAF to postpone WAfCON 2026 to a later date due to intense pressure on domestic league fixture list",
    "link": "https://www.maraviexpress.com/morocco-reportedly-to-request-caf-to-postpone-wafcon-2026-to-a-later-date-due-to-intense-pressure-on-domestic-league-fixture-list/",
    "published": "Wed, 04 Feb 2026 08:08:13 +0000",
    "summary": "* Repeated postponements of Morocco’s professional championship, due to several commitments including CHAN, the Arab Cup and AfCON 2025, have severely disrupted its national schedule * South Africa, who are set to host 2026 COSAFA Women’s Championship scheduled from February 18 to March 1, expresses readiness to step in if CAF decides that alternative arrangements are necessary By Duncan Mlanjira With less than 40 days to host Women’s Africa Cup of Nations (WAfCON) 2026, from March 17 to April 3, hosts Morocco are reported to be preparing to submit an...",
    "source": "Maravi Express"
  },
  {
    "title": "Luxembourg ties aid, investment to democracy and accountability",
    "link": "https://mwnation.com/luxembourg-ties-aid-investment-to-democracy-and-accountability/",
    "published": "Wed, 04 Feb 2026 07:42:00 +0000",
    "summary": "<p>Luxembourg Deputy Prime Minister and Minister of Foreign Affairs Xavier Bettel has said future development cooperation and investment with Malawi will hinge on governance, transparency and accountability as the European country opens a new phase of engagement in Africa. He said this on Monday during a meeting with&#160; President Peter Mutharika at Kamuzu Palace in &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/luxembourg-ties-aid-investment-to-democracy-and-accountability/\">Luxembourg ties aid, investment to democracy and accountability</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "SFFRFM dispatches 70% of Fisp fertiliser",
    "link": "https://mwnation.com/sffrfm-dispatches-70-of-fisp-fertiliser/",
    "published": "Wed, 04 Feb 2026 07:40:26 +0000",
    "summary": "<p>Smallholder Farmers Fertiliser Revolving Fund of Malawi (SFFRFM) says farm inputs redemption by farmers meant to benefit under the Farm Inputs Subsidy Programme (Fisp) is at around 70 percent. About 1.1 million farmers across the country were registered to benefit under the 2025-26 Fisp designed to protect the country’s poorest households from hunger by subsidising &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/sffrfm-dispatches-70-of-fisp-fertiliser/\">SFFRFM dispatches 70% of Fisp fertiliser</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "AG clarifies reinstated Mathanga’s benefits",
    "link": "https://mwnation.com/ag-clarifies-reinstated-mathangas-benefits/",
    "published": "Wed, 04 Feb 2026 07:35:09 +0000",
    "summary": "<p>Attorney General Frank Mbeta has clarified that reinstated Reserve Bank of Malawi (RBM) Deputy Governor for Economics and Regulation Henry Mathanga will not get benefits for the 2021 and 2025 period he was out of employment. Instead, the AG said Mathanga, whose reinstatement is with effect from January 1 2026, will simply enjoy benefits from &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/ag-clarifies-reinstated-mathangas-benefits/\">AG clarifies reinstated Mathanga’s benefits</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "Total steps back from South Africa court, big fuel case now returns to Malawi",
    "link": "https://www.nyasatimes.com/total-steps-back-from-south-africa-court-big-fuel-case-now-returns-to-malawi/",
    "published": "Wed, 04 Feb 2026 07:28:44 +0000",
    "summary": "<p>A long-running court fight involving TotalEnergies, the Malawi Government and Prima Fuels will now be decided in Malawi after TotalEnergies withdrew its case in South Africa. TotalEnergies had taken the matter to the Johannesburg High Court, trying to get an urgent ruling there. But in a letter dated February 2, 2026, the company’s South African [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/total-steps-back-from-south-africa-court-big-fuel-case-now-returns-to-malawi/\">Total steps back from South Africa court, big fuel case now returns to Malawi</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "Mutharika asks Malawians to pray for rains",
    "link": "https://mwnation.com/mutharika-asks-malawians-to-pray-for-rains/",
    "published": "Wed, 04 Feb 2026 07:28:11 +0000",
    "summary": "<p>President Peter Mutharika has asked Malawians to join hands in praying for good rains and an end to the prolonged dry spells that is affecting 19 of the country’s 28 districts. Presidential press secretary Cathy Maulidi said in a statement last evening that the President is appealing to people of all faiths to pray for &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/mutharika-asks-malawians-to-pray-for-rains/\">Mutharika asks Malawians to pray for rains</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "APM throws new minister Itaye to the deeper end",
    "link": "https://mwnation.com/apm-throws-new-minister-itaye-to-the-deeper-end/",
    "published": "Wed, 04 Feb 2026 07:26:27 +0000",
    "summary": "<p>President Peter Mutharika yesterday challenged his newest Cabinet appointee Simon Itaye to hit the ground running by taking full charge of economic recovery and transformation. In his remarks at Kamuzu Palace in Lilongwe, during the swearing in of Itaye as Minister of Industrialisation, Business, Trade and Tourism, the President said the entrepreneur and retired corporate &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/apm-throws-new-minister-itaye-to-the-deeper-end/\">APM throws new minister Itaye to the deeper end</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "Mutharika’s food for thought",
    "link": "https://mwnation.com/mutharikas-food-for-thought/",
    "published": "Wed, 04 Feb 2026 07:20:00 +0000",
    "summary": "<p>Just a few months into his new term, President Peter Mutharika is grappling with a triple crisis—a deep-seated food emergency, diminishing aid, and soaring debt. With over four million Malawians—about 22 percent of the population—facing the threat of acute malnutrition until the next harvest in March, Mutharika has declared a nationwide State of&#160; Disaster in &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/mutharikas-food-for-thought/\">Mutharika’s food for thought</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "MCP MPs boycott House committees over arrests",
    "link": "https://mwnation.com/mcp-mps-boycott-house-committees-over-arrests/",
    "published": "Wed, 04 Feb 2026 07:19:58 +0000",
    "summary": "<p>Malawi Congress Party (MCP) legislators yesterday walked out from several parliamentary committee meetings in Lilongwe in protest against the continued arrests of fellow lawmakers while undertaking Parliament business. Yesterday’s boycott, which included some independent members of Parliament (MPs) followed the arrests of Lilongwe Msozi North MP Sosten Gwengwe and his Dowa North East counterpart Sam &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/mcp-mps-boycott-house-committees-over-arrests/\">MCP MPs boycott House committees over arrests</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "Blantyre hotel project progress excites fund",
    "link": "https://mwnation.com/blantyre-hotel-project-progress-excites-fund/",
    "published": "Wed, 04 Feb 2026 07:13:00 +0000",
    "summary": "<p>The Public Service Pension Trust Fund says it is committed to investing in high-impact projects that safeguard members’ benefits while contributing to inclusive and sustainable economic growth. Speaking during a tour of its Cresta Lifestyle Hotel at Kristwick in the former Mulika Club premises near the Clock Tower in Blantyre on Thursday, the fund’s public &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/blantyre-hotel-project-progress-excites-fund/\">Blantyre hotel project progress excites fund</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "RBM to pay ‘dead’ bank billions",
    "link": "https://mwnation.com/rbm-to-pay-dead-bank-billions/",
    "published": "Wed, 04 Feb 2026 07:12:41 +0000",
    "summary": "<p>Taxpayers risk a further burden as the Reserve Bank of Malawi (RBM) is set to pay the ‘dead’ Finance Bank of Malawi compensation for loss of business since 2005 in compliance with a court ruling. Malawi Supreme Court of Appeal yesterday faulted the regulator of financial services’ decision to revoke Finance Bank’s licence over alleged &#8230;</p>\n<p>The post <a href=\"https://mwnation.com/rbm-to-pay-dead-bank-billions/\">RBM to pay ‘dead’ bank billions</a> appeared first on <a href=\"https://mwnation.com\">Nation Online</a>.</p>",
    "source": "Nation Online (The Nation)"
  },
  {
    "title": "ANALYSIS | Ben Phiri’s hands-on leadership finally breaks the Wakawaka deadlock",
    "link": "https://www.nyasatimes.com/analysis-ben-phiris-hands-on-leadership-finally-breaks-the-wakawaka-deadlock/",
    "published": "Wed, 04 Feb 2026 07:11:33 +0000",
    "summary": "<p>For more than four years, the Wakawaka market saga has stood as a symbol of policy paralysis in Malawi’s urban governance. It was a conflict defined by fear, political indecision, weak enforcement, and the quiet suffering of poor traders—especially women—trapped in a dangerous and illegal trading space that everyone acknowledged was wrong, yet no one [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/analysis-ben-phiris-hands-on-leadership-finally-breaks-the-wakawaka-deadlock/\">ANALYSIS | Ben Phiri’s hands-on leadership finally breaks the Wakawaka deadlock</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "62 Year-old Woman arrested For Possessing 15kg ‘Chamba’ stash in Lilongwe",
    "link": "https://www.faceofmalawi.com/2026/02/04/62-year-old-woman-arrested-for-15kg-chamba-stash-in-lilongwe/",
    "published": "Wed, 04 Feb 2026 07:00:30 +0000",
    "summary": "Detectives at Kawale Police Station in Lilongwe have arrested a 62-year-old woman after she was found in possession of 15 [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "Chithyola draws red line: MCP MPs will only return when their safety is guaranteed",
    "link": "https://www.nyasatimes.com/chithyola-draws-red-line-mcp-mps-will-only-return-when-their-safety-is-guaranteed/",
    "published": "Wed, 04 Feb 2026 06:59:10 +0000",
    "summary": "<p>Malawi Congress Party (MCP) lawmakers have hardened their stance against what they describe as the continued harassment and intimidation of Members of Parliament, making it clear they will not return to parliamentary business until they are 100 percent certain of their safety. The MPs yesterday boycotted parliamentary committee meetings in protest over the arrest of [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/chithyola-draws-red-line-mcp-mps-will-only-return-when-their-safety-is-guaranteed/\">Chithyola draws red line: MCP MPs will only return when their safety is guaranteed</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "Minister Phiri receives heroic welcome from vendors at Wakawaka Bypass Market",
    "link": "https://www.nyasatimes.com/minister-phiri-receives-heroic-welcome-from-vendors-at-wakawaka-bypass-market/",
    "published": "Wed, 04 Feb 2026 06:43:09 +0000",
    "summary": "<p>Minister of Local Government and Rural Development, Dr Ben Phiri, on Tuesday received a heroic welcome from vendors at the newly established Wakawaka Bypass Market, in what many traders described as a moment of long-awaited political intervention in a dispute that has dragged on for more than four years. Dr Phiri’s visit marked a major [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/minister-phiri-receives-heroic-welcome-from-vendors-at-wakawaka-bypass-market/\">Minister Phiri receives heroic welcome from vendors at Wakawaka Bypass Market</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "Saif al-Islam Gaddafi Shot Dead in Libya",
    "link": "https://www.faceofmalawi.com/2026/02/04/saif-al-islam-gaddafi-shot-dead-in-libya/",
    "published": "Wed, 04 Feb 2026 06:17:12 +0000",
    "summary": "Unknown assailants have shot and killed Saif al-Islam Gaddafi, the son of former Libyan leader Colonel Muammar Gaddafi. According to [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "Kaposi Sarcoma on the Rise as Malawi Faces Growing Cancer Threat",
    "link": "https://www.nyasatimes.com/kaposi-sarcoma-on-the-rise-as-malawi-faces-growing-cancer-threat/",
    "published": "Wed, 04 Feb 2026 05:11:19 +0000",
    "summary": "<p>Malawi is facing a worrying rise in cases of Kaposi sarcoma, a form of cancer that mainly attacks people with weakened immune systems, health authorities have warned. Officials from the Ministry of Health say the country is now recording nearly 3,000 new cases of Kaposi sarcoma every year, making it one of the most common [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/kaposi-sarcoma-on-the-rise-as-malawi-faces-growing-cancer-threat/\">Kaposi Sarcoma on the Rise as Malawi Faces Growing Cancer Threat</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "70% of Targeted FISP Beneficiaries Receive Farm Inputs Amid Major Challenges",
    "link": "https://www.nyasatimes.com/70-of-targeted-fisp-beneficiaries-receive-farm-inputs-amid-major-challenges/",
    "published": "Wed, 04 Feb 2026 05:07:19 +0000",
    "summary": "<p>Government says 70 percent of targeted beneficiaries under this year’s Farm Input Subsidy Programme (FISP) have successfully redeemed their fertiliser, marking significant progress despite the programme facing serious operational and logistical challenges. Deputy Minister of Agriculture, Thoko Tembo, described the development as a major milestone, saying it reflects strong commitment by both government and implementing [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/70-of-targeted-fisp-beneficiaries-receive-farm-inputs-amid-major-challenges/\">70% of Targeted FISP Beneficiaries Receive Farm Inputs Amid Major Challenges</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "Dr Mtumbuka Sympathises with Betere Residents as Heavy Rains Destroy Crops in Rumphi Central",
    "link": "https://www.malawivoice.com/2026/02/03/dr-mtumbuka-sympathises-with-betere-residents-as-heavy-rains-destroy-crops-in-rumphi-central/",
    "published": "Tue, 03 Feb 2026 19:07:13 +0000",
    "summary": "Aspiring Member of Parliament for Rumphi Central Constituency, Dr Matthews Mtumbuka, has expressed sympathy with residents of Betere following heavy rainfall that damaged 32 hectares of crop fields and affected 86 households. Dr Mtumbuka said he was shocked by the extent of the damage, which has left many farmers counting losses after their crops were [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "Improving policy implementation and working closely with the private sector will be central to achieving Itaye’s Ministry",
    "link": "https://www.maraviexpress.com/improving-policy-implementation-and-working-closely-with-the-private-sector-will-be-central-to-achieving-itayes-ministry/",
    "published": "Tue, 03 Feb 2026 18:46:27 +0000",
    "summary": "* This Ministry brings together industrialisation, business, trade and tourism, which are critical pillars for building a strong and resilient economy * As he takes oath of office with a call from President Mutharika for him to take immediate action to drive economic recovery and long term transformation By Rosalia Kapiri, MANA President Arthur Peter Mutharika has sworn in Simon Itaye as Minister of Industrialisation, Business, Trade &#38; Tourism, tasking him to take immediate action to drive economic recovery and long term transformation. And on his part Itaye described his...",
    "source": "Maravi Express"
  },
  {
    "title": "Government orders council officials to live in duty stations, cracks down on absenteeism and misuse of resources",
    "link": "https://www.nyasatimes.com/government-orders-council-officials-to-live-in-duty-stations-cracks-down-on-absenteeism-and-misuse-of-resources/",
    "published": "Tue, 03 Feb 2026 18:31:32 +0000",
    "summary": "<p>Government has issued a sweeping directive ordering all local council officials to reside in the districts where they are officially posted, in a move aimed at restoring discipline, improving service delivery and curbing the abuse of public resources. In a hard-hitting memorandum dated February 3, 2026, Secretary for Local Government and Rural Development Moses Chimphepo [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/government-orders-council-officials-to-live-in-duty-stations-cracks-down-on-absenteeism-and-misuse-of-resources/\">Government orders council officials to live in duty stations, cracks down on absenteeism and misuse of resources</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "Breaking News: Government Orders Council Officers To Reside In Their Duty Districts",
    "link": "https://www.malawivoice.com/2026/02/03/breaking-news-government-orders-council-officers-to-reside-in-their-duty-districts/",
    "published": "Tue, 03 Feb 2026 17:35:11 +0000",
    "summary": "The Ministry of Local Government and Rural Development has directed all council officers to reside in the districts where their designated duty stations are located, citing growing concerns over absenteeism and inefficiency caused by long-distance commuting. In a circular signed by Secretary for Local Government and Rural Development, Rev. Moses Owen Chimphepo, the Ministry observed [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "Minister Mbiridzi launches 2026 Tobacco Industry Afforestation, urges care for seedlings",
    "link": "https://www.nyasatimes.com/minister-mbiridzi-launches-2026-tobacco-industry-afforestation-urges-care-for-seedlings/",
    "published": "Tue, 03 Feb 2026 17:25:33 +0000",
    "summary": "<p>Minister of Agriculture, Irrigation and Water Development, Roza Fatchi  Mbilizi, on Tuesday launched the 2026 Tobacco Industry Afforestation Initiative at Nankokota Primary School in Traditional Authority Ganya, Ntcheu District. Speaking at the event, Mbiridzi urged all stakeholders to go beyond planting trees and ensure they are properly cared for until they grow. “Planting trees is [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/minister-mbiridzi-launches-2026-tobacco-industry-afforestation-urges-care-for-seedlings/\">Minister Mbiridzi launches 2026 Tobacco Industry Afforestation, urges care for seedlings</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "JUMA Gives Media Houses 90 Days to Settle Pension Arrears: “An injury to one is an injury to all”",
    "link": "https://www.malawivoice.com/2026/02/03/juma-gives-media-houses-90-days-to-settle-pension-arrears-an-injury-to-one-is-an-injury-to-all/",
    "published": "Tue, 03 Feb 2026 16:32:35 +0000",
    "summary": "The Journalists Union of Malawi (JUMA) has issued a 90-day ultimatum to all media houses to comply with the Pensions Act of 2023 or face legal action. In a joint statement, JUMA President Emmanuel Chibwana and Secretary General Nathan Majawa said some media organizations have failed to remit pension contributions or have accumulated arrears, putting [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "NBM plc, Portland Cement team up to cut cement imports",
    "link": "https://www.malawivoice.com/2026/02/03/nbm-plc-portland-cement-team-up-to-cut-cement-imports/",
    "published": "Tue, 03 Feb 2026 14:26:07 +0000",
    "summary": "National Bank of Malawi (NBM) plc and Portland Cement Malawi have reaffirmed their commitment to rolling out initiatives that strengthen the country’s cement supply chain, improve access to financing for distributors, and reduce reliance on imported cement. The collaboration follows the signing of a Memorandum of Understanding (MoU) between the two institutions in Blantyre in [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "DEFENCE MINISTER PAYS MAIDEN VISIT TO MDF HEADQUARTERS IN LILONGWE",
    "link": "https://www.malawivoice.com/2026/02/03/defence-minister-pays-maiden-visit-to-mdf-headquarters-in-lilongwe/",
    "published": "Tue, 03 Feb 2026 13:57:35 +0000",
    "summary": "By Lance Corporal Lynne Mussah The newly appointed Minister of Defence, Honourable Feston Kaupa Mp, made his maiden visit to the Malawi Defence Force (MDF) Joint Force Headquarters in Lilongwe, marking a significant step in strengthening defence cooperation. Upon arrival at Kamuzu Barracks, Minister Kaupa was accorded a General Salute and inspected a Guard of [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "President Mutharika puts economy at centre as new minister takes office",
    "link": "https://www.malawivoice.com/2026/02/03/president-mutharika-puts-economy-at-centre-as-new-minister-takes-office/",
    "published": "Tue, 03 Feb 2026 13:51:54 +0000",
    "summary": "By Rosalia Kapiri Lilongwe, February 03, MANA: President Professor Arthur Peter Mutharika has sworn in Simon Itaye as Minister of Industrialisation, Business, Trade and Tourism, tasking him to take immediate action to drive economic recovery and long term transformation. The swearing in ceremony took place on Tuesday at Kamuzu Palace in Lilongwe at a time [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "Airtel Malawi enhances customer experience with upgraded shop at Kamuzu International Airport",
    "link": "https://www.maraviexpress.com/airtel-malawi-enhances-customer-experience-with-upgraded-shop-at-kamuzu-international-airport/",
    "published": "Tue, 03 Feb 2026 13:38:34 +0000",
    "summary": "* A total 42 shops earmarked for upgrades across Malawi with modern ambience, wood accents, bold red panels and backlit signature Airtel logo * As we invest in strengthening our network capacity and expanding coverage, it is equally important that the physical spaces where we meet and serve our customers reflect the same level of progress By Duncan Mlanjira Airtel Malawi Plc has officially opened a refurbished customer service shop at Kamuzu International Airport (KIA), marking the first completed outlet under the company’s nationwide shop refurbishment program. The initiative aims...",
    "source": "Maravi Express"
  },
  {
    "title": "Malawi to reap from $3.9m AfDB support",
    "link": "https://times.mw/malawi-to-reap-from-3-9m-afdb-support/?utm_source=rss&utm_medium=rss&utm_campaign=malawi-to-reap-from-3-9m-afdb-support",
    "published": "Tue, 03 Feb 2026 13:36:31 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"683\" src=\"https://times.mw/wp-content/uploads/2024/03/ENERGISED-Chintheche-Substation-is-now-rehabilitated-under-the-Compact-1024x683.jpg\" width=\"1024\" /><p>Malawi is among 13 African countries that are set to benefit from a new $3.9 million <a href=\"https://times.mw/afdb-sees-malawi-gdp-growing-by-3-in-2025/\">African Development Bank (AfDB)</a> technical assistance project.</p>\n<p>Other beneficiaries are Chad, Gabon, Tanzania, Mauritania, the Democratic Republic of Congo (DRC), Kenya, Nigeria, Madagascar, Ethiopia, Lesotho, Namibia and Uganda.</p>\n<p>The initiative is aimed at turning national energy plans into concrete electricity connections under the Mission 300 initiative.</p>\n<p>The two-year project, known as the Africa Energy Sector Technical Assistance Programme (AESTAP) Mission 300 Phase II, will support countries to implement their national energy compacts, which outline how governments intend to expand electricity access, strengthen power utilities and attract private investment.</p>\n<p>In a publication dated January 30, 2026, AfDB says the programme will, over the next 24 months, provide direct technical assistance to help countries move from documented plans to actual electricity connections for homes, schools, hospitals and businesses.</p>\n<p>The bank says the second phase will focus on improving electricity regulations, planning and tariff systems to unlock investment, strengthening utilities to reduce losses and improve reliability and placing expert advisers within national compact delivery and monitoring units (CDMUs) to coordinate reforms and track progress.</p>\n<p>AfDB Director for Energy Financial Solutions, Policy and Regulation Wale Shonibare says countries have made ambitious commitments through their energy compacts.</p>\n<p>“Now, through AESTAP Mission 300 Phase II, we are helping them implement those commitments so that more households, entrepreneurs and communities actually get electricity,” he says.</p>\n<p>The new phase follows the approval of AESTAP Mission 300 Phase I in December 2025, when it provided about $1 million to help countries establish and operate their CDMUs.</p>\n<p>Energy policy expert Edgar Kapiza Bayani said Malawi had policy frameworks in place but required more resources to realise the 70 percent electricity connections coverage target by 2030.</p>\n<p>“I wish we had more resources going directly towards increasing the generation capacity of the country, direct resources going towards supporting off-grid energy players to deploy more mini-grids, more home systems and all that. But this grant essentially is just the technical implementation [part],” Bayani said.</p>\n<p>Bayani said the mini-grid sub-sector in Malawi needed $ 1.1 billion to take off.</p>\n<p>He therefore expressed mixed feelings on Malawi achieving the 2030 targets without more direct resources to implement activities that would accelerate electricity access.</p>\n<p>“I am not saying we don’t need technical assistance in some areas but I think, from 2016, there have been quite a number of reforms that have been happening and what we need are the resources to go to the next level,” Bayani said.</p>\n<p>Under Mission 300, Malawi is implementing the Accelerating Sustainable and Clean Energy Access Transformation programme with a $250.8 million World Bank grant signed in January 2025.</p>\n<p>The grant is aimed at increasing national electricity access from about 25 percent to 70 percent by 2030.</p>\n<p>According to the Malawi National Energy Compact, achieving this target will require an additional 1.15 million on-grid connections and 1.55 million off-grid connections, as well as expanding installed generation capacity by 848 megawatts through a mix of technologies.</p>\n<p>Mission 300 is a joint AfDB-World Bank initiative that seeks to connect 300 million Africans to electricity by 2030.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "Police charge Gwengwe, Kawale, Zamba over K200bn East Bridge fertilizer deal",
    "link": "https://www.faceofmalawi.com/2026/02/03/police-charge-gwengwe-kawale-zamba-over-k200bn-east-bridge-fertilizer-deal/",
    "published": "Tue, 03 Feb 2026 13:30:09 +0000",
    "summary": "The Malawi Police Service (MPS) has arrested former Cabinet ministers Sosten Gwengwe and Sam Kawale, alongside former Secretary to the [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "Opposition Leader Takes Speaker to Task Over Arrest of MPs",
    "link": "https://www.nyasatimes.com/opposition-leader-takes-speaker-to-task-over-arrest-of-mps/",
    "published": "Tue, 03 Feb 2026 13:20:12 +0000",
    "summary": "<p>Leader of Opposition in Parliament, Simplex Chithyola Banda, has put Speaker of Parliament Sameer Suleman under intense pressure, accusing him of failing to protect lawmakers after police arrested two Members of Parliament while official Parliamentary Committee meetings were in progress. Chithyola Banda says the Speaker has now been compelled to engage the Inspector General of [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/opposition-leader-takes-speaker-to-task-over-arrest-of-mps/\">Opposition Leader Takes Speaker to Task Over Arrest of MPs</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "Airtel Africa post-tax profit grows to $586m",
    "link": "https://times.mw/airtel-africa-post-tax-profit-grows-to-586m/?utm_source=rss&utm_medium=rss&utm_campaign=airtel-africa-post-tax-profit-grows-to-586m",
    "published": "Tue, 03 Feb 2026 13:19:02 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"579\" src=\"https://times.mw/wp-content/uploads/2026/02/taldar.jpg\" width=\"470\" /><p>Post-tax-profit for Airtel Africa more than doubled to $586 million in the nine-month period to December 31, 2025, up from $248 million in the prior period.</p>\n<p>In a statement, the Airtel Malawi parent company says the higher profit-after-tax was driven by higher operating profit and derivative and foreign exchange gains of $99 million, compared to $153 million derivative and foreign exchange losses in the prior period.</p>\n<p>The group’s revenue rose by 28.3 percent to $4.67bn (24.6 percent constant currency).</p>\n<p>Its revenues of $4,667 million increased by 24.6 percent in constant currency and 28.3 percent in reported currency as currency appreciation supported the strong underlying fundamentals of the business.</p>\n<p>The firm says its mobile services revenue grew by 23.3 percent in constant currency.</p>\n<p>Data revenues, the largest contributor to the group revenues, increased 36.5 percent with voice revenues growing by 13.5 percent.</p>\n<p><a href=\"https://times.mw/mobile-money-subscribers-surpass-20-million-mark/\">Mobile money</a> revenues continue to benefit from the strong operating momentum to deliver 29.4 percent growth in constant currency.</p>\n<p>It says the company’s customer-centric strategy continues to underpin strong operating momentum, with increased network investment, digitisation and innovative new partnerships, demonstrating tangible progress in delivering our strategic priorities.</p>\n<p>Its total customer base increased by 10 percent to 179.4 million, with data customers of 81.8 million, growing 14.6 percent.</p>\n<p>The first milestone saw the business exceed 50 million subscribers, reaching 52.0 million customers up 17.3 percent.</p>\n<p>In the statement, Airtel Africa Chief Executive Officer Sunil Taldar says the results highlight the strength of their strategy, with strong operating and financial trends across the business.</p>\n<p>“Our push to enhance financial inclusion across the continent continues to gain momentum with our Mobile Money customer base expanding to 52 million, surpassing the 50 million milestones.</p>\n<p>“Annualised total processed value of over $210bn in Q3 ‘26 underscores the depth of our merchants, agents and partner ecosystem, and remains a key player in driving improved access to financial services across Africa. We remain on track for the listing of Airtel Money in the first half of 2026,” he says.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "Reserve Bank of Malawi to compensate Finance Bank with billions over wrongful closure",
    "link": "https://www.nyasatimes.com/reserve-bank-of-malawi-to-compensate-finance-bank-with-billions-over-wrongful-closure/",
    "published": "Tue, 03 Feb 2026 13:17:17 +0000",
    "summary": "<p>The Reserve Bank of Malawi is expected to compensate the Finance Bank over wrongful closure following a landmark Supreme Court of Appeal ruling today in Blantyre. Financial and legal analysts say the compensation could run into billions if not trillions of Kwachas once worked out. The Supreme Court of Appeal ruled that the Reserve Bank [&#8230;]</p>\nThe post <a href=\"https://www.nyasatimes.com/reserve-bank-of-malawi-to-compensate-finance-bank-with-billions-over-wrongful-closure/\">Reserve Bank of Malawi to compensate Finance Bank with billions over wrongful closure</a> appeared first on <a href=\"https://www.nyasatimes.com\">Malawi Nyasa Times - News from Malawi about Malawi</a>.",
    "source": "Nyasa Times"
  },
  {
    "title": "Portland production up, to cut imports bill",
    "link": "https://times.mw/portland-production-up-to-cut-imports-bill/?utm_source=rss&utm_medium=rss&utm_campaign=portland-production-up-to-cut-imports-bill",
    "published": "Tue, 03 Feb 2026 13:13:32 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"582\" src=\"https://times.mw/wp-content/uploads/2026/02/portland-1024x582.jpg\" width=\"1024\" /><p class=\"article-text\" style=\"line-height: 19.2pt; vertical-align: baseline; margin: 0cm 0cm 19.2pt 0cm;\"><span style=\"color: black;\">Port­land Cement Malawi Lim­ited has increased its cement pro­duc­tion to 70 per­cent capa­city, a devel­op­ment that is expec­ted to save the coun­try more than $30 mil­lion annu­ally by redu­cing reli­ance on impor­ted cement. </span><span style=\"color: black;\">Port­land Cement Malawi Lim­ited Chief Exec­ut­ive Officer Jian­guo Liu said the increased out­put fol­lowed the com­pany’s invest­ment of over K200 bil­lion in a new cement plant in Bal­aka Dis­trict. </span></p>\n<p class=\"article-text\" style=\"line-height: 19.2pt; vertical-align: baseline; margin: 0cm 0cm 19.2pt 0cm;\"><span style=\"color: black;\">The plant has raised pro­duc­tion capa­city to 800,000 met­ric tonnes per year. </span><span style=\"color: black;\">Liu said the expan­ded capa­city would sup­port national infra­struc­ture devel­op­ment while ensur­ing a steady sup­ply of cement on the local mar­ket. </span><span style=\"color: black;\">“With the increased pro­duc­tion, we are able to sta­bil­ise cement sup­ply and con­trib­ute to price sta­bil­ity on the mar­ket while help­ing the coun­try con­serve for­eign exchange that was pre­vi­ously spent on imports,” Liu said.</span></p>\n<p class=\"article-text\" style=\"line-height: 19.2pt; vertical-align: baseline; margin: 0cm 0cm 19.2pt 0cm;\"><span style=\"color: black;\">He also com­men­ded National Bank of Malawi (NBM) for sup­port­ing cement sup­pli­ers and trans­port­ers through tar­geted fin­an­cial incent­ives, which he said had helped improve avail­ab­il­ity of the product across the coun­try. </span><span style=\"color: black;\">Mean­while, NBM Board Chair­per­son Grant Kabango has said the bank has, so far, dis­bursed over K3.2 bil­lion to cement sup­pli­ers and trans­port­ers as part of efforts to strengthen col­lab­or­a­tion with play­ers in pro­duct­ive sec­tors of the eco­nomy. </span><span style=\"color: black;\">Kabango said the fin­an­cing was aimed at sup­port­ing the entire cement sup­ply chain in order to enhance effi­ciency and avail­ab­il­ity of the product nation­wide. </span></p>\n<p class=\"article-text\" style=\"line-height: 19.2pt; vertical-align: baseline; margin: 0cm 0cm 19.2pt 0cm;\"><span style=\"color: black;\">“Our inter­ven­tion is about con­serving for­eign exchange and sup­port­ing local pro­duc­tion. We decided to provide the requis­ite fin­an­cing to cover the entire cement sup­ply chain, start­ing from pro­cure­ment all the way to dis­tri­bu­tion across the coun­try,” Kabango said. </span></p>\n<p class=\"article-text\" style=\"line-height: 19.2pt; vertical-align: baseline; margin: 0cm 0cm 19.2pt 0cm;\"><span style=\"color: black;\">He said since the sign­ing of a memor­andum of under­stand­ing (MoU) with Port­land Cement in Octo­ber last year, K3.2 bil­lion had been util­ised, largely in Blantyre, where the ini­tial phase was imple­men­ted. </span><span style=\"color: black;\">Kabango added that the bank expec­ted the fig­ures to rise as demand grows, par­tic­u­larly with Port­land Cement open­ing a depot in Kan­engo, Lilongwe. </span><span style=\"color: black;\">“The res­ults we have seen in Blantyre are very prom­ising and, with expan­sion into the Cent­ral Region, we anti­cip­ate increased demand for fin­an­cing. We, as National Bank of Malawi, are ready and adequately resourced to sup­port these fin­an­cing needs,” he said.</span></p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "Big Names, Big Money: Gwengwe, Kawale, Zamba in Over K200bn Fertiliser Contracts",
    "link": "https://www.malawivoice.com/2026/02/03/big-names-big-money-gwengwe-kawale-zamba-in-over-k200bn-fertiliser-contracts/",
    "published": "Tue, 03 Feb 2026 12:16:57 +0000",
    "summary": "Police have indicated that former Minister of Finance Sosten Gwengwe, former Minister of Agriculture Sam Kawale and former Secretary to the President and Cabinet Colleen Zamba have been arrested in connection with over K200 billion fertiliser contracts awarded to East Bridge According to a statement issued by the Malawi Police spokesperson Lael Chimtembo, the three [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "Malawi, Luxembourg pledge to deepen cooperation",
    "link": "https://times.mw/malawi-luxembourg-pledge-to-deepen-cooperation/?utm_source=rss&utm_medium=rss&utm_campaign=malawi-luxembourg-pledge-to-deepen-cooperation",
    "published": "Tue, 03 Feb 2026 10:36:49 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"547\" src=\"https://times.mw/wp-content/uploads/2026/02/mutharika-bettel.jpg\" width=\"846\" /><p><strong>By Wezzie Gausi: </strong></p>\n<p>Malawi Government and Luxembourg officials have committed to strengthen bilateral relations.</p>\n<p>This transpired Monday, when President Peter Mutharika said he appreciated the visit by Luxembourg Deputy Prime Minister and Minister of Foreign Affairs Xavier Bettel.</p>\n<p>Mutharika reaffirmed Malawi’s dedication to deepening the partnership, particularly as the two countries prepare to sign a General Cooperation Agreement today.</p>\n<p>Outlining his vision for Malawi’s economic transformation, the President said the country was shifting from a predominantly importing and consuming economy to one that produces and exports.</p>\n<p>“I, therefore, invite you and Luxembourg investors to set up companies in Malawi. The country has a conducive environment for investment,” Mutharika said.</p>\n<p>He said Malawi’s peace, hardworking and well-educated labour force as well as supportive policies presented advantages for business growth.</p>\n<p>In his remarks, Mutharika also extended best wishes to Luxembourg in its candidature for a non-permanent seat on the United Nations Security Council.</p>\n<p>He added that Malawi currently chairs the Peace and Security Organ of the Southern African Development Community Troika and is on course to joining the African Union Peace and Security Council, reflecting the country’s growing role in regional peace and stability.</p>\n<p>On his part, Bettel congratulated Mutharika on his electoral victory in the September 16, 2025 Presidential Election.</p>\n<p>“We see Malawi as a trusted partner and a country with strong potential for growth. Luxembourg is ready to work closely with your government to turn your development vision into practical cooperation that benefits both our peoples,” Bettel said.</p>\n<p>He said Luxembourg was particularly interested in strengthening cooperation in areas such as governance, development assistance, and private sector investment.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "MHRC report exposes heavy discrimination",
    "link": "https://times.mw/mhrc-report-exposes-heavy-discrimination/?utm_source=rss&utm_medium=rss&utm_campaign=mhrc-report-exposes-heavy-discrimination",
    "published": "Tue, 03 Feb 2026 10:33:12 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"699\" src=\"https://times.mw/wp-content/uploads/2026/02/boniface-massa.jpg\" width=\"982\" /><p><strong>By Pemphero Malimba </strong></p>\n<p>The Malawi Human Rights Commission (MHRC) has released a report following a public inquiry it conducted.</p>\n<p>The report has exposed discrimination that persons with disability face when accessing public services across the country.</p>\n<p>MHRC released the report in Lilongwe Monday.</p>\n<p>The report has exposed discrimination which persons with disability face when accessing employment opportunities and health, education and disaster risk management services, among others.</p>\n<p>For example, the inquiry has exposed the shortage of specialist teachers, inadequate learning materials and inaccessible school infrastructure, which it says forces learners with disability to face exclusion, bullying and poor academic performance.</p>\n<p>“The commission finds that the inaccessibility of school infrastructure and facilities, therefore, makes it impossible for learners with disabilities to fully participate in the teaching and learning process on an equal basis with others. This limits their prospects of excelling in their education,” it says.</p>\n<p>On health, the inquiry found that there was inaccessible infrastructure, lack of disability awareness among health workers, shortage of essential medication and discriminatory behaviour in the provision of sexual reproductive health and rights services.</p>\n<p>“The inquiry established deep-rooted discriminatory practices against women and girls with disabilities who seek sexual reproductive health and rights (SRHR). Women with disabilities reported having faced a hostile environment when seeking SRHR in health facilities, where, among others, some healthcare workers, especially “nurses”, often subject them to “discriminatory, insensitive, derogatory and bullying” remarks,” it says.</p>\n<p>On employment, the inquiry has exposed discrimination in recruitment, inaccessible world places, lack of reasonable accommodation and weak enforcement in legal provisions.</p>\n<p>It says this forces women with disability to face double discrimination whereas qualified individuals are denied promotions due to lack of accessible materials.</p>\n<p>“The inquiry established that during recruitment interviews, many employers fail to provide reasonable accommodation to enable candidates with disabilities to compete on an equal basis with others,” it says.</p>\n<p>On disaster risk management, the inquiry exposes that during relief distribution, persons with disability do not access disability specific needs such as assistive devices, dietary requirements, among others, as the authorities provide relief items focusing only on food, blankets and shelter materials.</p>\n<p>The commission has directed the Ministry of Health to provide reasonable accommodation, through enforcement of accessibility standards, in all health facilities by installing ramps to ease mobility of wheelchair users and the blind, among other things.</p>\n<p>“The Ministry of Health and district health offices should ensure that sexual reproductive health services are accessible to women and girls with disabilities without discrimination.</p>\n<p>This should include thorough investigations and disciplining of all healthcare workers who ridicule women with disabilities [when they are] seeking SRHR services,” it says.</p>\n<p>The commission has also recommended that the Ministry of Education, Science and Technology should review teacher education training curricula to develop robust disability-inclusive teacher training curricula that address specific disability category requirements as a means of fostering inclusive learning.</p>\n<p>“The Ministry of Education should train and recruit more special needs teachers, with continuous professional development in inclusive pedagogy, sign language and braille. The Ministry of Education, in collaboration with district councils, should ensure that school infrastructure and facilities adhere to universal design standards that promote physical accessibility for learners with disabilities,” it says.</p>\n<p>On employment, the commission has recommended that the Department of Human Resource Management and Development, the Local Government Service Commission, and Civil Service Commission should enforce anti-discrimination provisions in recruitment, including the mandatory provision of reasonable accommodation, including accessible interview venues, materials such as braille, large print and sign language interpreters.</p>\n<p>MHRC has also recommended that Dodma and Macoda should collaborate and develop communication and early disaster warning system guidelines that are disability-inclusive, taking into consideration diverse disability needs.</p>\n<p>In an interview, MHRC Commissioner Boniface Massa said the commission expected all concerned stakeholders to act on the recommendations.</p>\n<p>“It is our high expectation that heads of those institutions [Ministry of Health, Malawi Council for disability Affairs, Department of Disaster Management Affairs, Ministry of Education] will be able to look at this report and provide recommendations.</p>\n<p>“Our follow-up step is engagement because we are not there to police these institutions but we are reminding them of their duty and responsibility to ensure that their services are inclusive of the needs of people with disability,” Massa said.</p>\n<p>Ministry of Gender Director of Disability and the Elderly Programmes David Njaidi said the government would engage all government institutions that were targeted on the matter.</p>\n<p>“We had the same concern that the Malawi Human Rights Commission has raised and we need to build capacity of government [institutions] as well as other agencies on disability issues,” Njaidi said.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "Nico opens up on Queens, sponsorship",
    "link": "https://times.mw/nico-opens-up-on-queens-sponsorship/?utm_source=rss&utm_medium=rss&utm_campaign=nico-opens-up-on-queens-sponsorship",
    "published": "Tue, 03 Feb 2026 10:29:14 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"756\" src=\"https://times.mw/wp-content/uploads/2026/02/malawi-queens-1024x756.jpg\" width=\"1024\" /><p>Nico Group has called for a holistic approach and increased investment in structured high‑performance programmes to rebuild domestic netball and continue revamping the Malawi National Netball Team.</p>\n<p>In a statement released Monday, Nico has also pledged to support the Queens ahead of this year’s Commonwealth Games.</p>\n<p>The group, which sponsors the Queens and One Nico Top 12 Cup, released a statement after completing the first circle of their sponsorship.</p>\n<p>Nico Group Head of Corporate Affairs Mbumba Mlia-Ndasauka said consistent exposure to local and high‑level international competition and long‑term athlete development pathways were some of the initiatives that would help rebuild the sport and the Queens.</p>\n<p>“As such, we will continue working with Nam to identify and train new talent to ensure the team’s continuity.</p>\n<figure class=\"wp-caption alignleft\" id=\"attachment_45266\" style=\"width: 137px;\"><img alt=\"\" class=\"size-medium wp-image-45266\" height=\"300\" src=\"https://times.mw/wp-content/uploads/2026/02/mbumba-mlia-ndasauka-137x300.jpg\" width=\"137\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-45266\"><em><strong>MLIANDASAUKA— </strong></em><em><strong>We identified new </strong></em><em><strong>talent</strong></em></figcaption></figure>\n<p>“As the Malawi Queens are set to participate in this year’s Commonwealth Games in July, we will ensure they receive adequate preparation training,” Mlia-Ndasauka said.</p>\n<p>She said the first year of sponsorship was both insightful and inspiring, reinforcing Nico’s belief in sport’s power to unite, empower and elevate national pride.</p>\n<p>“Our partnership with the Queens, through Nam, has been a rewarding, professionally managed collaboration. From inception, Nam demonstrated strong leadership, transparency and a shared commitment to advancing [the cause of] netball in Malawi. This alignment enabled Nico Group to integrate seamlessly into the team’s journey, not merely as a sponsor but as a genuine partner invested in the Queens’ growth and success.</p>\n<p>“Together, we were able to implement all agreed components to uplift netball. Our focus has been to rebuild the sport and we have started this journey well. We have been able to get our Queens playing in local and international games, we launched the One Nico Top 12 Netball Cup and conducted a nationwide talent scouting exercise,” she said.</p>\n<p>She added that the first year allowed Nico to assess the potential of the sport to become a source of national pride.</p>\n<p>“Together with Nam, we identified new talent and skills that will continue to enhance the team’s performance,” she said.</p>\n<p>Mlia-Ndasauka singled out the launch of the One Nico Top 12 Netball Cup as one of the big things in 2025.</p>\n<p>“This tournament promotes local club games and continuous player participation. It also allowed Nam to identify talent.</p>\n<p>“The scouting exercise was another highlight of the sponsorship. Nam identified untapped talent from communities across Malawi. These young girls had only dreamed of becoming netballers but had never had a chance to compete at any level because of lack of sports facilities in their areas and their proximity to them. This is what the Nico Group is about – turning dreams into reality. We believe in making an impact on Malawians. We believe in leaving no one behind in the life journey,” she said.</p>\n<p>Last year, the Queens finished fourth during the Africa Netball Cup, which the country hosted in December last year.</p>\n<p>Nam General Secretary Yamikani Khungwa-Kauma said the association was grateful to Nico Group for the support.</p>\n<p>“It will be another eventful year and we certainly need massive support to prepare thoroughly and compete effectively at the forthcoming games,” he said.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "Mob Justice Claims Teen’s Life in Dedza",
    "link": "https://www.faceofmalawi.com/2026/02/03/mob-justice-claims-teens-life-in-dedza/",
    "published": "Tue, 03 Feb 2026 10:29:10 +0000",
    "summary": "A young man believed to be between 17 and 20 years old has been killed by an angry mob in [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "Haiya stops Nyamilandu in ‘Face2Face’ defamation case",
    "link": "https://www.faceofmalawi.com/2026/02/03/haiya-stops-nyamilandu-in-face2face-defamation-case/",
    "published": "Tue, 03 Feb 2026 10:28:11 +0000",
    "summary": "The High Court of Malawi has granted Football Association of Malawi (FAM) president Fleetwood Haiya an interlocutory injunction against his [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "Construction regulator pushes for compliance",
    "link": "https://times.mw/construction-regulator-pushes-for-compliance/?utm_source=rss&utm_medium=rss&utm_campaign=construction-regulator-pushes-for-compliance",
    "published": "Tue, 03 Feb 2026 10:24:33 +0000",
    "summary": "<img alt=\"\" class=\"attachment-large size-large wp-post-image\" height=\"531\" src=\"https://times.mw/wp-content/uploads/2026/02/gerald-khonje.jpg\" width=\"474\" /><p><strong>By Mcloyd Chilangiza :</strong></p>\n<p>The Construction Industry Regulatory Authority (Cira) has urged players in the construction sector to comply with its regulations in order to ensure the delivery of quality services.</p>\n<p>The call was made during a sensitisation meeting in Mzuzu City Monday, when it was aimed at briefing stakeholders on oversight functions of the authority following its transition from a council to a fully-fledged regulatory authority.</p>\n<p>The transition from National Construction Industry Council (NCIC) to Cira follows amendments to the Construction Industry Act, which came into effect in June last year.</p>\n<p>The reforms seek to align Malawi’s construction sector with international best practices, enhance transparency and support the government’s infrastructure development agenda.</p>\n<p>Cira Chief Executive Officer, engineer Gerald Khonje, advised contractors to comply with all mandates and functions of the authority.</p>\n<p>“Compliance is very crucial because, for us to have quality infrastructure, all parties involved in a project, including those designing, planning, budgeting, procuring and operating it, must adhere to quality standards to ensure that whatever we do is predictably of high  standard,” he said.</p>\n<figure class=\"wp-caption alignleft\" id=\"attachment_45271\" style=\"width: 267px;\"><img alt=\"\" class=\"size-medium wp-image-45271\" height=\"300\" src=\"https://times.mw/wp-content/uploads/2026/02/william-mbobe-267x300.jpg\" width=\"267\" /><figcaption class=\"wp-caption-text\" id=\"caption-attachment-45271\"><em><strong>MBOBE—We are in business</strong></em></figcaption></figure>\n<p>Khonje also implored councils, contractors and other stakeholders to collaborate on development projects to improve transparency and accountability as part of efforts to root out corruption.</p>\n<p>Commenting on the issues, Sitbec Limited Managing Director William Mbobe expressed hope that the new framework would improve compliance levels and promote fair competition within the industry.</p>\n<p>“We, as contractors, are in business and the framework that has been put in place means that we will all be compliant,” he said.</p>",
    "source": "Times 360 Malawi / Times Group"
  },
  {
    "title": "RCCG Launches Lunch Hour Prayers in Blantyre",
    "link": "https://www.malawivoice.com/2026/02/03/rccg-launches-lunch-hour-prayers-in-blantyre/",
    "published": "Tue, 03 Feb 2026 09:10:11 +0000",
    "summary": "By Mayamiko Phiri The Redeemed Christian Church of God (RCCG) Southern Province has introduced lunch hour prayer services aimed at helping people strengthen their spiritual lives during the workday. The prayer service was launched on Monday at the church’s premises in Blantyre’s central business area, opposite the Post Office building. The event was marked by [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "NICO Commits to Continued Support for Netball",
    "link": "https://www.malawivoice.com/2026/02/03/nico-commits-to-continued-support-for-netball/",
    "published": "Tue, 03 Feb 2026 08:58:05 +0000",
    "summary": "NICO Group Limited has reaffirmed its commitment to the development of netball in Malawi following a review of the first year of its sponsorship of the Malawi National Netball Team, the Queens, and the NICO One Top 12 Netball Cup. Speaking during the review, NICO Group Head of Corporate Affairs, Mbumba Mlia-Ndasauka, described the first [&#8230;]",
    "source": "Malawi Voice"
  },
  {
    "title": "Apocalypto star Gerardo Taracena dies at 55",
    "link": "https://www.faceofmalawi.com/2026/02/03/apocalypto-star-gerardo-taracena-dies-at-55/",
    "published": "Tue, 03 Feb 2026 08:13:12 +0000",
    "summary": "Renowned Mexican actor Gerardo Taracena, widely recognized for his unforgettable role as the fierce warrior Middle Eye in the 2006 [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "MISA Malawi Mourns Death of Mzimba Community Radio Deputy Station Manager James Nyirenda",
    "link": "https://www.faceofmalawi.com/2026/02/03/misa-malawi-mourns-death-of-mzimba-community-radio-deputy-station-manager-james-nyirenda/",
    "published": "Tue, 03 Feb 2026 07:37:41 +0000",
    "summary": "The Media Institute of Southern Africa (MISA) Malawi, through its Chairperson Golden Matonga, has expressed deep sorrow over the death [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "How Queen Nadia TV is Setting the Internet Ablaze with Pun@n! Flashing Reels-Blink and you miss it",
    "link": "https://www.faceofmalawi.com/2026/02/03/how-queen-nadia-tv-is-setting-the-internet-ablaze-with-punn-flashing-reels-blink-and-you-miss-it/",
    "published": "Tue, 03 Feb 2026 06:34:17 +0000",
    "summary": "Move over, traditional influencers, there’s a new sovereign in town, and she’s not playing by the rules. Zimbabwean viral sensation [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "The back-door qualification by Minister Gangata’s Masters Security into the elite league shouldn’t have been tolerated",
    "link": "https://www.maraviexpress.com/the-back-door-qualification-by-minister-gangatas-masters-security-into-the-elite-league-shouldnt-have-been-tolerated/",
    "published": "Sun, 01 Feb 2026 12:44:02 +0000",
    "summary": "* Baka City is the name that should be recognised as promoted into the elite league while Masters Security should be recognised as sponsors until end of season There is deafening celebration of Masters Security FC’s return into the top flight league, the FDH Bank Premiership, in the 2026 season after buying Baka City&#8217;s ‘ownership’ rights — but this back-door qualification shouldn’t have been tolerated. In the first place, the team got disbanded way back in 2019 when it got demoted from the just recently dissolved TNM Super League and...",
    "source": "Maravi Express"
  },
  {
    "title": "RBM outlines conditions on application for newly-introduced diaspora foreign currency denominated accounts",
    "link": "https://www.maraviexpress.com/rbm-outlines-conditions-on-application-for-newly-introduced-diaspora-foreign-currency-denominated-accounts/",
    "published": "Sun, 01 Feb 2026 10:41:13 +0000",
    "summary": "* Diaspora FCDAs are foreign currency accounts held in Malawi by Malawian citizens residing outside Malawi * These accounts must not be funded with money that does not originate from Malawi and is not derived from export earnings By Duncan Mlanjira The Reserve Bank of Malawi (RBM) has issued a conditions to be followed when applying for diaspora foreign currency denominated accounts (FCDAs). In a public communique issued on Friday by Deputy Governor-Economics &#38; Regulator, Henry Mathanga, the RBM explains that the FCDAs have been created to ensure that Malawians...",
    "source": "Maravi Express"
  },
  {
    "title": "FAM identifies Scorchers WAfCON Limited Edition kit submitted by Blantyre-based designer Thandi Phiri",
    "link": "https://www.maraviexpress.com/fam-identifies-scorchers-wafcon-limited-edition-kit-submitted-by-blantyre-based-designer-thandi-phiri/",
    "published": "Sun, 01 Feb 2026 10:28:39 +0000",
    "summary": "* Her submission stood out for its creativity, originality, and full compliance with CAF kit regulations — earning her the top honours * With the Scorchers qualifying for the WAfCON finals, we felt it was important to introduce a limited-edition kit to mark this historic achievement * The public should expect the official unveiling of the jersey in the first week of March ahead of the WAfCON that kicks off March 17 By Duncan Mlanjira The Football Association of Malawi (FAM) has awarded Blantyre-based designer Thandi Phiri for submitting a...",
    "source": "Maravi Express"
  },
  {
    "title": "Mudi SACCO completes its 35th Anniversary commemoration by posting landmark surplus of K1 billion in 2025",
    "link": "https://www.maraviexpress.com/mudi-sacco-completes-its-35th-anniversary-commemoration-by-posting-landmark-surplus-of-k1-billion-in-2025/",
    "published": "Sat, 31 Jan 2026 12:05:42 +0000",
    "summary": "* Growth of 83% that was posted in 2024 of K580 million with share value at 176% from 140.80% in 2024 and loan portfolio at over K4.4 billion from over K3.2 billion in 2024 * Despite the country’s economic challenges, Mudi managed to rectruit 5,936 new members in 2025 representing 54% of total target down from 2024’s 65% target * First to hold members’ annual general meeting for the 3rd successive year — beating by far the deadline of April set by SACCO regulations By Duncan Mlanjira Being one of...",
    "source": "Maravi Express"
  },
  {
    "title": "Mixed reactions from the public over DRTSS’ enforcement of traffic regulation against ferrying passengers using lorries",
    "link": "https://www.maraviexpress.com/mixed-reactions-from-the-public-over-drtss-enforcement-of-traffic-regulation-against-ferrying-passengers-using-lorries/",
    "published": "Mon, 02 Feb 2026 18:52:43 +0000",
    "summary": "* Some suggest that the government, through Directorate of Road Traffic &#38; Safety Services (DRTSS), should first offer alternatives p to areas where buses do not operate * The law is the law, this is true but from the 50 plus years I&#8217;ve been on mother Earth, buses and minibuses have killed many people in Malawi compared to lorries and pickups which operate on bad conditions of roads in rural areas roads * However, others defend the DRTSS, saying it’s when we lose our loved ones, that we will realise...",
    "source": "Maravi Express"
  },
  {
    "title": "Trio arrested Over Violent Robbery in Salima",
    "link": "https://www.faceofmalawi.com/2026/02/02/trio-arrested-over-violent-robbery-in-salima/",
    "published": "Mon, 02 Feb 2026 16:02:54 +0000",
    "summary": "Police in Salima have arrested three men for allegedly attacking a traveler and stealing a motorcycle and other valuables worth [&#8230;]",
    "source": "Face of Malawi"
  },
  {
    "title": "Airtel Africa Plc posts strong 3rd quarter financial performance",
    "link": "https://www.maraviexpress.com/airtel-africa-plc-posts-strong-3rd-quarter-financial-performance/",
    "published": "Mon, 02 Feb 2026 11:09:23 +0000",
    "summary": "* Total customer base grew 10% to 179.4 million, with data customers up 14.6% to 81.8 million and smartphone penetration rising to 48.1% * Airtel Money customers reached 52 million, surpassing the 50 million milestone, while annualised processed value exceeded US$210 billion * Group revenue rose 28.3% to US$4.67 billion (24.6% constant currency), EBITDA increased 35.9% to US$2.28 billion and profit after tax more than doubled to US$586 million By Duncan Mlanjira Airtel Africa Plc has published its results for the nine‑month period ended December 31, 2025, reporting another quarter...",
    "source": "Maravi Express"
  },
  {
    "title": "Vehicle registration number does not expire but the plates due to wear and tear from substandard material",
    "link": "https://www.maraviexpress.com/vehicle-registration-number-does-not-expire-but-the-plates-due-to-wear-and-tear-from-substandard-material/",
    "published": "Mon, 02 Feb 2026 10:29:38 +0000",
    "summary": "* Where the seven-year period has elapsed but the number plate remains clear, legible, visible and compliant with the law, the plate may continue to be used on the vehicle * The inclusion of an expiry date is intended to safeguard motorists against the purchase of substandard number plates and not to impose arbitrary replacement requirements By Duncan Mlanjira The enforcement of the expiry date on vehicle number plates is based on the condition and quality of the reflective material as prescribed under Regulation 15A of Road Traffic (Registration and...",
    "source": "Maravi Express"
  }
]